УТ.РасширениеКонтурЛогистика/src/InformationRegisters/КонтурЛогистика_Аутентификация/КонтурЛогистика_Аутентификация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_Аутентификация</name>
  <resources>
    <name>ДатаОкончания</name>
    <comment>Местное время</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ВремяЖизни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаОкончанияМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортальныйИд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.РасширениеКонтурЛогистика/src/InformationRegisters/КонтурЛогистика_Аутентификация/Forms/ФормаАвторизацииОрганизаций/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвторизацияПриОткрытии") Тогда
		АвторизацияПриОткрытии = Истина;
	КонецЕсли;
	
	ЗаполнитьСписокНашихОрганизаций();
	
	УстановитьУсловноеОформление();
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82()
		Или КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоРежимСовместимости_8_2() Тогда
		
		Элементы.ДекорацияГруппаВыбратьВсе.Видимость = Ложь;
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(
		Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка());
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНашиОрганизации;
	
	ОбновитьВидимостьДоступность();
	
	Если АвторизацияПриОткрытии Тогда
		ПодключитьОбработчикОжидания("АвторизацияОрганизации", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ФормаПроверкиПравДоступа_Закрытие"
		И Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписокОрганизаций Тогда
		
		Если ТипЗнч(Параметр) = Тип("СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок")
			И ЗначениеЗаполнено(Параметр) Тогда
			
			ВыбранныеОрганизации = ВыбранныеОрганизации();
			
			ЗаполнитьСписокОрганизаций();
			
			// Перейдем на строку с организацией
			Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
				
				Если ВыбранныеОрганизации.Найти(ТекущаяСтрока.Организация) <> Неопределено Тогда
					ТекущаяСтрока.Наш = Истина;					
				КонецЕсли;
				
				Если ТекущаяСтрока.Организация <> Параметр Тогда
					Продолжить;
				КонецЕсли;
				
				Элементы.СписокОрганизаций.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОрганизацияЗаписана"
		И Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНашиОрганизации Тогда
		
		ЗаполнитьСписокНашихОрганизаций();
		
		ОбновитьВидимостьДоступность();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы = Неопределено Или Не ЗавершениеРаботы Тогда
		Оповестить("КонтурЛогистика_Аутентификация");
		Оповестить("КонтурЛогистика_ПерепроверитьДокумент");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияАвторизоватьсяНажатие(Элемент)
	
	АвторизоватьсяНаПортале();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьОнлайнКонсультантНажатие(Элемент)
	
	КонтурЛогистика_ЦентрПоддержкиКлиент.ОткрытьЦентрПоддержки();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьНетНужнойОрганизацииНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(
		"https://support.kontur.ru/logistika-1s/82041-avtorizaciya_v_module#header_82041_1");
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Авторизация", "Нет нужной организации",
		"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСписокОрганизацийПустПодсказка8Нажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке("https://diadoc.kontur.ru/");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСписокОрганизацийПустПодсказка9Нажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке("https://support.kontur.ru/logistika/51865-avtoregistraciya_organizacij)");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНашихОрганизаций

&НаКлиенте
Процедура СписокНашихОрганизацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Поле.Имя = "СписокНашихОрганизацийДействие1"
		Или Поле.Имя = "СписокНашихОрганизацийДействие2" Тогда
		
		Если Поле.Имя = "СписокНашихОрганизацийДействие1" Тогда
			ТекущееДействие = ТекущиеДанные.Действие1;
		Иначе
			ТекущееДействие = ТекущиеДанные.Действие2;
		КонецЕсли;
		
		Если ТекущееДействие = "Авторизоваться" Тогда
			
			АвторизоватьсяНаПортале(ТекущиеДанные.Организация);
			
			ДопИнформация = Новый Структура;
			ДопИнформация.Вставить("BoxID", ТекущиеДанные.DiadocBoxId);
			
			КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Наши организации", "Авторизоваться",
				"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций",,, ДопИнформация);
			
		ИначеЕсли ТекущееДействие = "Обновить" Тогда
			
			ОбновитьАвторизациюНаПортале(ТекущиеДанные.Организация);
			
		ИначеЕсли Лев(ТекущееДействие, 5) = "Выйти" Тогда
			
			ЗавершитьСессиюНаПортале(ТекущиеДанные.Организация);
			
			ДопИнформация = Новый Структура;
			ДопИнформация.Вставить("BoxID", ТекущиеДанные.DiadocBoxId);
			
			КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Наши организации", "Выйти",
				"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций",,, ДопИнформация);
			
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "СписокОрганизацийОрганизация" Тогда
		
		ПоказатьЗначение(, ТекущиеДанные.Организация);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНашихОрганизацийОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНашихОрганизацийОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокОрганизаций

&НаКлиенте
Процедура СписокОрганизацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Поле.Имя = "СписокОрганизацийДействие" Тогда
		
		Если ТекущиеДанные.ПраваДоступа = "Недостаточно прав" Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация", ТекущиеДанные.Организация);
			ПараметрыФормы.Вставить("Токен", Токен);
			ПараметрыФормы.Вставить("ФИО", ФИО);
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаПроверкиПравДоступа", ПараметрыФормы,
				ЭтаФорма,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца, Истина);
			
		ИначеЕсли ТекущиеДанные.ПраваДоступа = "Зарегистрировать в Логистике" Тогда
			
			Если ТекущиеДанные.ЭтоАдминистратор Тогда
				СсылкаРегистрацииВЛогистике = "https://logist.kontur.ru/new-box-diadoc";
			Иначе
				СсылкаРегистрацииВЛогистике = "https://logist.kontur.ru/new-box";
			КонецЕсли;
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(СсылкаРегистрацииВЛогистике);
			
			ДопИнформация = Новый Структура;
			ДопИнформация.Вставить("BoxID", ТекущиеДанные.DiadocBoxId);
			
			КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Авторизация", "Зарегистрировать в Логистике",
				"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций",,, ДопИнформация);
			
		ИначеЕсли ТекущиеДанные.ПраваДоступа = "Ошибка" Тогда
			
			Сообщить(ТекущиеДанные.ТекстОшибки);
			
		ИначеЕсли ТекущиеДанные.ПраваДоступа = "Необходима оплата тарифа АПИ" Тогда
			
			СсылкаНаПриобритение = "https://kontur.ru/logistika#order";
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(СсылкаНаПриобритение);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеПриИзменении(Элемент)
	
	Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
		Если ТекущаяСтрока.ПраваДоступа = "" Тогда
			ТекущаяСтрока.Наш = ВыбратьВсе;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОрганизацийНашПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокОрганизаций.ТекущиеДанные;
	
	Если ТекущиеДанные.ПраваДоступа = "Недостаточно прав" Тогда
		ТекстСообщения = "Недостаточно прав у пользователя. Необходимо настроить.";
	ИначеЕсли ТекущиеДанные.ПраваДоступа = "Зарегистрировать в Логистике" Тогда
		ТекстСообщения = "Необходимо зарегистрировать организацию в Логистике";
	ИначеЕсли ТекущиеДанные.ПраваДоступа = "Необходима оплата тарифа АПИ" Тогда
		ТекстСообщения = "Необходима оплата тарифа АПИ";
	ИначеЕсли ТекущиеДанные.ПраваДоступа = "Ошибка" Тогда
		ТекстСообщения = "Необходима исправить ошибку: " + ТекущиеДанные.ТекстОшибки;
	Иначе
		ТекстСообщения = "";
	КонецЕсли;
	
	Если ТекстСообщения <> "" Тогда
		Сообщить(ТекстСообщения);
		ТекущиеДанные.Наш = Ложь;
	КонецЕсли;
	
	ВсеНаши = Истина;
	
	Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
		Если Не ТекущаяСтрока.Наш Тогда
			ВсеНаши = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ВыбратьВсе = ВсеНаши;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОрганизацийОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОрганизацийОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьОрганизацию(Команда)
	
	АвторизацияОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура КАвторизации(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНашиОрганизации;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(
		ПредопределенноеЗначение("Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка"));
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура Авторизация(Команда)
	
	ДобавитьНашуОрганизацию();
	
	ЗаполнитьСписокНашихОрганизаций();
	
	КАвторизации(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриступитьКРаботе(Команда)
	
	ЕстьАвторизции = КонтурЛогистика_ОбщегоНазначенияСервер.ЕстьПортальныеАвторизации();
	
	ДопИнформация = Новый Структура;
	Для Каждого ТекущиеДанные Из СписокНашихОрганизаций Цикл
		Если Лев(ТекущиеДанные.Действие1, 5) = "Выйти" Тогда
			ДопИнформация.Вставить("BoxID", ТекущиеДанные.DiadocBoxId);
		КонецЕсли;
	КонецЦикла;
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Наши организации", "Авторизоваться",
		"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций",,, ДопИнформация);
	
	Закрыть(ЕстьАвторизции);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Можно подключить
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокОрганизацийПояснение");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокОрганизаций.ПраваДоступа");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(192, 192, 192));
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<можно подключить>");
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДоступность()
	
	Элементы.ФормаДобавитьОрганизацию.Видимость = Ложь;
	Элементы.КАвторизации.Видимость = Ложь;
	Элементы.ГруппаОнлайнКонсультант.Видимость = Ложь;
	Элементы.ПриступитьКРаботе.Видимость = Ложь;
	Элементы.Авторизация.Видимость = Ложь;
	Элементы.ГруппаДействияДекорацияРасширитель1.Видимость = Ложь;
	Элементы.ГруппаДействияДекорацияРасширитель2.Видимость = Истина;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНашиОрганизации Тогда
		
		Заголовок = "Наши организации";
		Элементы.ГруппаОнлайнКонсультант.Видимость = Истина;
		Элементы.ФормаДобавитьОрганизацию.Видимость = Истина;
		Элементы.ПриступитьКРаботе.Видимость = Истина;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОжиданияАвторизации
		Или Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНеудачаАвторизации
		Или Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОжиданиеЗагрузкиОрганизаций Тогда
		
		Заголовок = "Авторизация...";
		Элементы.КАвторизации.Видимость = Истина;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписокОрганизацийПуст Тогда
		
		Заголовок = "Выбор организации для работы в модуле";
		Элементы.КАвторизации.Видимость = Истина;
		Элементы.ГруппаОнлайнКонсультант.Видимость = Истина;
		Элементы.ГруппаДействияДекорацияРасширитель1.Видимость = Истина;
		Элементы.ГруппаДействияДекорацияРасширитель2.Видимость = Ложь;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписокОрганизаций Тогда
		
		Заголовок = "Выбор организации для работы в модуле";
		Элементы.КАвторизации.Видимость = Истина;
		Элементы.Авторизация.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокНашихОрганизаций(Организация = Неопределено)
	
	СписокНашихОрганизаций.Очистить();
	
	// Получим данные
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Организация,
	|	КонтурЛогистика_ОрганизацииДиадок.ИНН + ""-"" + КонтурЛогистика_ОрганизацииДиадок.КПП КАК ОрганизацияИННКПП,
	|	КонтурЛогистика_Аутентификация.ФИО КАК Авторизация,
	|	КонтурЛогистика_ОрганизацииДиадок.Наш КАК Наш,
	|	КонтурЛогистика_Аутентификация.ДатаОкончания КАК АвторизацияСрок,
	|	КонтурЛогистика_ОрганизацииДиадок.ID КАК DiadocBoxId
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_Аутентификация КАК КонтурЛогистика_Аутентификация
	|		ПО (КонтурЛогистика_Аутентификация.Организация = КонтурЛогистика_ОрганизацииДиадок.Ссылка)
	|ГДЕ
	|	КонтурЛогистика_ОрганизацииДиадок.Наш
	|	И НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления";
	
	ПереченьОрганизаций = Запрос.Выполнить().Выгрузить();
	
	СписокНашихОрганизаций.Загрузить(ПереченьОрганизаций);
	
	// Проствим действие
	Для Каждого ТекущаяСтрока Из СписокНашихОрганизаций Цикл
		
		Если Не ТекущаяСтрока.Наш Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.Авторизация) Тогда
			ТекущаяСтрока.Действие1 = "Выйти (" + ТекущаяСтрока.Авторизация + ")";
			ТекущаяСтрока.Действия1ИндексКартинки = 2;
			ТекущаяСтрока.Действие2 = "";
			ТекущаяСтрока.Действия2ИндексКартинки = 4;
		Иначе
			ТекущаяСтрока.Действие1 = "Авторизоваться";
			ТекущаяСтрока.Действия1ИндексКартинки = 0;
			ТекущаяСтрока.Действие2 = "";
			ТекущаяСтрока.Действия2ИндексКартинки = 4;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Организация) И ТекущаяСтрока.Организация = Организация Тогда
			ИдентификаторТекущейСтроки = ТекущаяСтрока.ПолучитьИдентификатор();
		КонецЕсли; 
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИдентификаторТекущейСтроки) Тогда
		// Спозицианируемся на ней
		Элементы.СписокНашихОрганизаций.ТекущаяСтрока = ИдентификаторТекущейСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОрганизаций()
	
	СписокОрганизаций.Очистить();
	ДоступныеОрганизации.Очистить();
	
	Если Токен <> "" Тогда
		
		// Если первый запуск, то будет пусто
		ЕстьОрганизации = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьОрганизации();
		
		// Получим доступные организации
		МоиОрганизацииДиадок = КонтурЛогистика_API_Диадок.Диадок_АПИ_GetMyOrganizations(Токен);
		
		Если МоиОрганизацииДиадок.Organizations.Количество() = 0 Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписокОрганизацийПуст;
			Возврат;
		КонецЕсли;
		
		Для Каждого ДанныеОрганизации Из МоиОрганизацииДиадок.Organizations Цикл
			ОрганизацияПоДанным = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЗаполнитьОрганизациюИзДанныхДиадока(ДанныеОрганизации);
			Если ЗначениеЗаполнено(ОрганизацияПоДанным) Тогда
				ДоступныеОрганизации.Добавить(ОрганизацияПоДанным);
			Иначе
				Сообщить("Не удалось создать организацию: " + ДанныеОрганизации.FullName + "(" + ДанныеОрганизации.Inn + ")");
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЕстьОрганизации Тогда
			// Перенесем из модулей Контура
			ПараметрыУстановкиМодулейКонтура = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПараметрыУстановкиМодулей();
			КонтурЛогистика_ОбщегоНазначенияСервер.ПереносСопоставленийОрганизацийСОбъектамиУС(
				ДоступныеОрганизации.ВыгрузитьЗначения(), ПараметрыУстановкиМодулейКонтура);
		КонецЕсли;
		
	КонецЕсли;
	
	// Получим данные
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДоступныеОрганизации", ДоступныеОрганизации.ВыгрузитьЗначения());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Организация,
	|	КонтурЛогистика_ОрганизацииДиадок.ИНН + ""-"" + КонтурЛогистика_ОрганизацииДиадок.КПП КАК ОрганизацияИННКПП,
	|	КонтурЛогистика_Аутентификация.ФИО КАК Авторизация,
	|	КонтурЛогистика_ОрганизацииДиадок.Наш КАК Наш,
	|	КонтурЛогистика_Аутентификация.ДатаОкончания КАК АвторизацияСрок,
	|	КонтурЛогистика_ОрганизацииДиадок.ID КАК DiadocBoxId
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_Аутентификация КАК КонтурЛогистика_Аутентификация
	|		ПО (КонтурЛогистика_Аутентификация.Организация = КонтурЛогистика_ОрганизацииДиадок.Ссылка)
	|ГДЕ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка В(&ДоступныеОрганизации)
	|	И НЕ КонтурЛогистика_ОрганизацииДиадок.Наш";
	
	ПереченьОрганизаций = Запрос.Выполнить().Выгрузить();
	
	СписокОрганизаций.Загрузить(ПереченьОрганизаций);
	
	// Проствим действие
	Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
		
		РезультатПроверкиПрав = КонтурЛогистика_API_Диадок.ПроверкаПравДляРаботыСервисом(
			ТекущаяСтрока.Организация, Токен);
		ТекущаяСтрока.ЭтоАдминистратор = РезультатПроверкиПрав.ЭтоАдминистратор;
		ТекущаяСтрока.ТекстОшибки = РезультатПроверкиПрав.ТекстОшибки;
		
		Если РезультатПроверкиПрав.ПравДостаточно Тогда
			ТекущаяСтрока.ПраваДоступа = "";
		ИначеЕсли Не РезультатПроверкиПрав.ОплатаТарифа Тогда
			ТекущаяСтрока.ПраваДоступа = "Необходима оплата тарифа АПИ";
		ИначеЕсли РезультатПроверкиПрав.ТекстОшибки <> "" Тогда
			ТекущаяСтрока.ПраваДоступа = "Ошибка";
		Иначе
			ТекущаяСтрока.ПраваДоступа = "Недостаточно прав";
		КонецЕсли;
		
	КонецЦикла;
	
	// Права Логистики
	ПравДостаточно_Логистика = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.ПроверкаПравДляРаботыСервисом(, Токен);
	Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
		
		Если ТекущаяСтрока.ПраваДоступа <> "" Тогда
			// Уже и так ясно что прав недостаточно
			Продолжить;
		КонецЕсли;
		
		ПереченьНедостающихПрав = ПравДостаточно_Логистика.Получить(ТекущаяСтрока.DiadocBoxId);
		
		Если ПереченьНедостающихПрав = Неопределено Тогда
			ТекущаяСтрока.ПраваДоступа = "Зарегистрировать в Логистике";
		ИначеЕсли ПереченьНедостающихПрав.Количество() <> 0 Тогда
			ТекущаяСтрока.ПраваДоступа = "Недостаточно прав";
		КонецЕсли;
		
	КонецЦикла;
	
	// Расчитаем индекс сортировки, пояснения и действие
	Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
		
		Если ТекущаяСтрока.ПраваДоступа = "" Тогда
			ТекущаяСтрока.ИндексСортировки = 0;
			ТекущаяСтрока.Пояснение = "";
			ТекущаяСтрока.Действие = "";
		ИначеЕсли ТекущаяСтрока.ПраваДоступа = "Недостаточно прав" Тогда
			ТекущаяСтрока.ИндексСортировки = 1;
			ТекущаяСтрока.Пояснение = "Недостаточно прав у пользователя";
			ТекущаяСтрока.Действие = "Настройте";
		ИначеЕсли ТекущаяСтрока.ПраваДоступа = "Зарегистрировать в Логистике" Тогда
			ТекущаяСтрока.ИндексСортировки = 2;
			ТекущаяСтрока.Пояснение = "Нет в сервисе Контур.Логистика";
			ТекущаяСтрока.Действие = "Зарегистрируйте";
		ИначеЕсли ТекущаяСтрока.ПраваДоступа = "Необходима оплата тарифа АПИ" Тогда
			ТекущаяСтрока.ИндексСортировки = 3;
			ТекущаяСтрока.Пояснение = "Необходима оплата тарифа АПИ";
			ТекущаяСтрока.Действие = "Оставить заявку";
		Иначе
			ТекущаяСтрока.ИндексСортировки = 4;
			ТекущаяСтрока.Пояснение = "Возникла непредвиденная ошибка";
			ТекущаяСтрока.Действие = "Исправить ошибку";
		КонецЕсли;
		
	КонецЦикла;
	СписокОрганизаций.Сортировать("ИндексСортировки");
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписокОрганизаций;
	
КонецПроцедуры

&НаКлиенте
Процедура АвторизоватьсяНаПортале(Организация = Неопределено)
	
	// Очистим пустую сессию
	КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(
		ПредопределенноеЗначение("Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка"));
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ГруппаСтраницы", Элементы.ГруппаСтраницы.ТекущаяСтраница);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ДополнительныеПараметры.Вставить("Организация", Организация);
	Иначе
		ДополнительныеПараметры.Вставить("Организация", ПредопределенноеЗначение("Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка"));
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОжиданияАвторизации;
	
	Оповещение = Новый ОписаниеОповещения("ПослеАутентификации", ЭтаФорма, ДополнительныеПараметры, "ОшибкаАутентификации", ЭтаФорма);
	
	ОтборСессий = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОтборСессий(Организация);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПолучениеСессии(Оповещение, ОтборСессий);
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНашуОрганизацию()
	
	КоличествоНашихОрганизаций = 0;
	
	Организации = Новый Массив;
	Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
		
		Если Не ТекущаяСтрока.Наш Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоНашихОрганизаций = КоличествоНашихОрганизаций + 1;
		
		Организации.Добавить(ТекущаяСтрока.Организация);
		
		ОрганизацияОбъект = ТекущаяСтрока.Организация.ПолучитьОбъект();
		ОрганизацияОбъект.Наш = Истина;
		ОрганизацияОбъект.Записать();
		
		Справочники.КонтурЛогистика_ОрганизацииДиадок.УстановитьНастройку(
			ТекущаяСтрока.Организация, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуДиадок, Истина);
		
		Справочники.КонтурЛогистика_ОрганизацииДиадок.УстановитьНастройку(
			ТекущаяСтрока.Организация, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуЛогистики, Истина);
		
	КонецЦикла;
	
	РегистрыСведений.КонтурЛогистика_Аутентификация.ПодменитьОбщуюАутентификациюПодКонкретные(Организации);
	
	// Синхронизируем контрагентов
	Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
		
		Если Не ТекущаяСтрока.Наш Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не КонтрагентыОрганизацииСинхронизированы(ТекущаяСтрока.Организация) Тогда
			// Синхронизируем контрагентов
			ПараметрыМетода = Новый Структура;
			ПараметрыМетода.Вставить("ОрганизацияСсылка", ТекущаяСтрока.Организация);
			
			КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьВФоне(
				"КонтурЛогистика_ДлительныеОперацииСервер.СинхронизироватьКонтрагентовОрганизации",
				ПараметрыМетода,, "Синхронизировать контрагентов организации");
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоличествоНашихОрганизаций <> 0 Тогда
		ПеременныеСтатистики = Новый Структура;
		ПеременныеСтатистики.Вставить("КоличествоОрганизацийДляАвторЦизации", КоличествоНашихОрганизаций);
		
		КонтурЛогистика_Метрика.ЗарегистрироватьСтатистику(ПеременныеСтатистики,
			"Авторизация", "Авторизоваться", "РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтрагентыОрганизацииСинхронизированы(ОрганизацияСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияСсылка", ОрганизацияСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурЛогистика_ОрганизацииДиадокКонтрагенты.Контрагент КАК Контрагент
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок.Контрагенты КАК КонтурЛогистика_ОрганизацииДиадокКонтрагенты
	|ГДЕ
	|	КонтурЛогистика_ОрганизацииДиадокКонтрагенты.Ссылка = &ОрганизацияСсылка";
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

&НаКлиенте
Процедура ОбновитьАвторизациюНаПортале(Организация)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Организация", Организация);
	ДополнительныеПараметры.Вставить("ГруппаСтраницы", Элементы.ГруппаСтраницы.ТекущаяСтраница);
	
	Оповещение = Новый ОписаниеОповещения("ПослеАутентификации", ЭтаФорма, ДополнительныеПараметры);
	
	ОтборСессий = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОтборСессий(Организация);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОбновитьСессии(Оповещение, ОтборСессий);
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСессиюНаПортале(Организация)
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(Организация);
	
	ЗаполнитьСписокНашихОрганизаций();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеАутентификации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНеудачаАвторизации;
		
	Иначе
		
		Если ДополнительныеПараметры.ГруппаСтраницы = Элементы.ГруппаНашиОрганизации Тогда
			
			// Получим доступные организации
			МоиОрганизацииДиадок = КонтурЛогистика_API_Диадок.Диадок_АПИ_GetMyOrganizations(Результат.ТокенДоступа);
			
			Если МоиОрганизацииДиадок.Organizations.Количество() = 0 Тогда
				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписокОрганизацийПуст;
				КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(ДополнительныеПараметры.Организация);
				Возврат;
			КонецЕсли;
			
			// Проверим, что текущая организация доступна текущему пользователю
			ОрганизацияДоступна = Ложь;
			ТекущийOrgId = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
				ДополнительныеПараметры.Организация, "OrgId");
			Для Каждого ТекущаяСтрока Из МоиОрганизацииДиадок.Organizations Цикл
				Если ТекущаяСтрока.OrgId = ТекущийOrgId Тогда
					ОрганизацияДоступна = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Не ОрганизацияДоступна Тогда
				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНашиОрганизации;
				КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(ДополнительныеПараметры.Организация);
				Сообщить("Авторизованный пользователь не имеет доступа к выбранной организации: "
					+ Строка(ДополнительныеПараметры.Организация));
				Возврат;
			КонецЕсли;
			
			// По нашей организации
			РезультатПроверкиПрав = КонтурЛогистика_API_Диадок.ПроверкаПравДляРаботыСервисом(
				ДополнительныеПараметры.Организация, Результат.ТокенДоступа);
			Если Не РезультатПроверкиПрав.ПравДостаточно Тогда
				
				Если РезультатПроверкиПрав.ПереченьНедостающихПрав.Количество() <> 0 Тогда
					ОткрытьФормуПроверкиПравДоступа(ДополнительныеПараметры.Организация, Результат.ТокенДоступа, Результат.ФИО);
				ИначеЕсли Не РезультатПроверкиПрав.ОплатаТарифа Тогда
					Сообщить("Необходима оплата тарифа АПИ");
				ИначеЕсли РезультатПроверкиПрав.ТекстОшибки <> "" Тогда
					Сообщить(РезультатПроверкиПрав.ТекстОшибки);
				КонецЕсли;
				
				КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(ДополнительныеПараметры.Организация);
				
			КонецЕсли;
			
			Если Не КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.ПравДостаточноДляРаботыСервисом(
				ДополнительныеПараметры.Организация, Результат.ТокенДоступа) Тогда
				
				ОткрытьФормуПроверкиПравДоступа(ДополнительныеПараметры.Организация, Результат.ТокенДоступа, Результат.ФИО);
				
				КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(ДополнительныеПараметры.Организация);
				
			КонецЕсли;
			
			ЗаполнитьСписокНашихОрганизаций(ДополнительныеПараметры.Организация);
			
			// Отправить метрику успешной авторизации
			ОрганизацийДД = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДополнительныеПараметры.Организация);
			КонтурЛогистика_Метрика.Общепродуктовая_ОтправитьАвторизацию(ОрганизацийДД, "OIDC_Админ");
			
			Элементы.ГруппаСтраницы.ТекущаяСтраница = ДополнительныеПараметры.ГруппаСтраницы;
			
		Иначе
			
			// Список доступных
			Токен = Результат.ТокенДоступа;
			ФИО = Результат.ФИО;
			
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОжиданиеЗагрузкиОрганизаций;
			
			ПодключитьОбработчикОжидания("ЗаполнитьСписокОрганизацийПослеАутентификации", 0.1, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокОрганизацийПослеАутентификации()
	
	ЗаполнитьСписокОрганизаций();
	
	ЗарегистрироватьПолучениеОрганизацийВМетриках();
	
	// Отправить метрику успешной авторизации
	ОрганизацийДД = Новый Массив;
	Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
		Если ТекущаяСтрока.ПраваДоступа = "" Тогда
			ОрганизацийДД.Добавить(ТекущаяСтрока.Организация);
		КонецЕсли;
	КонецЦикла;
	Если ОрганизацийДД.Количество() <> 0 Тогда
		КонтурЛогистика_Метрика.Общепродуктовая_ОтправитьАвторизацию(ОрганизацийДД, "OIDC_Админ");
	КонецЕсли;
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьПолучениеОрганизацийВМетриках()
	
	Переменные = Новый Структура;
	Переменные.Вставить("КоличествоОрганизаций", СписокОрганизаций.Количество());
	Переменные.Вставить("НедостаточноПрав", 0);
	Переменные.Вставить("НетВЛогистике", 0);
	Переменные.Вставить("Ошибка", 0);
	
	Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
		
		Если ТекущаяСтрока.ПраваДоступа = "Ошибка" Тогда
			
			Переменные.Ошибка = Переменные.Ошибка + 1;
			
		ИначеЕсли ТекущаяСтрока.ПраваДоступа = "Недостаточно прав" Тогда
			
			Переменные.НедостаточноПрав = Переменные.НедостаточноПрав + 1;
			
		ИначеЕсли ТекущаяСтрока.ПраваДоступа = "Зарегистрировать в Логистике" Тогда
			
			Переменные.НетВЛогистике = Переменные.НетВЛогистике + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	КонтурЛогистика_Метрика.ЗарегистрироватьСтатистику(Переменные, "Авторизация", "Получение организаций из ДД",
		"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПроверкиПравДоступа(Организация, ТокенДоступа, ФИО)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("Токен", ТокенДоступа);
	ПараметрыФормы.Вставить("ФИО", ФИО);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаПроверкиПравДоступа", ПараметрыФормы,
		ЭтаФорма,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкаАутентификации(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНеудачаАвторизации;
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

// Возвращает список организаций, отмеченных как "Наша организация" в таблице формы СписокОрганизаций.
// 
// Возвращаемое значение:
//  Массив - Массив ссылок на организации (СправочниСсылка.КонтурЛогистика_ОрганизацииДиадок), у которых в колонке "Наш" установлено значение Истина.
// 
&НаКлиенте
Функция ВыбранныеОрганизации()
	
	Результат = Новый Массив;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Наш", Истина);
	
	НайденныеСтроки = СписокОрганизаций.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Результат.Добавить(НайденнаяСтрока.Организация);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура АвторизацияОрганизации()
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписокОрганизаций;
	
	АвторизоватьсяНаПортале();
	
	ОбновитьВидимостьДоступность();
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Наши организации", "Добавить организацию",
		"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций");
	
КонецПроцедуры

#КонецОбласти
